---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsRailingTangentConnection
source: html/eca18225-5d39-ab52-8d6e-d86a0efbbe01.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsRailingTangentConnection Property

"Tangent Joins"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsRailingTangentConnection { get; }
```